Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase
The Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase class is a base class used to wrap the manipulator concept for the DM API.
System.IDisposable

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase.disposed
Indicates whether resources have been disposed of.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase.#ctor(Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase class.
manipulationContext: The manipulation context that this manipulator should be attached to.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase.ManipulationContext
Gets the manipulation context.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase.Dispose


Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase.AttachToManipulatorService(Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService)
Attaches the internal manipulator to the manipulator service.
manipulatorService: The manipulator service.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase.Dispose(System.Boolean)
Releases unmanaged and - optionally - managed resources.
disposing: true to release both managed and unmanaged resources; false to release only unmanaged resources.